# Pandas with SQL

In this hands-on activity, we'll practice working with databases with Pandas. We will also review how to connect to SQLite with the `sqlite3` module and try the same process with `SQLAlchemy`. Let's dive straight into it!

In [5]:
import sqlite3 as sqlite, pandas as pd
from sqlalchemy import create_engine

For demonstration purposes, we'll create a database, `population.db`, and insert one table with the name, Population, which represents the population in different countries.

In [6]:
with sqlite.connect('population.db') as con:
    cur = con.cursor()    
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

### Creating Connection with SQLAlchemy
Another option is, to connect to the SQLite (or any other supported databases) database using SQLAlchemy. This type of connection is also recommended by Pandas.

In [7]:
connection = create_engine('sqlite:///population.db')
#  The only required parameter in the create_engine function is a connection string.

### Reading SQL data with Pandas

1. Reading a querry
`read_sql_querry()`
This method requires two parameters as input. The first parameter is a string with a SQL query and the second one is a connection to the database

In [8]:
# Create the querry
sql = 'Select * from Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql_query(sql, con)

In [9]:
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

2. Read SQL Table
`read_sql_table()`
Compared to the read_sql_query() method, the first argument is the table name instead of the SQL query. The second argument stays the same.

In [11]:
# create the query
table = 'Population'
with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql_table(table, con)

In [12]:
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

3. Read SQL ` read_sql()`
- This function is a combination of the two mentioned above. Depending on the type of the first argument (SQL query or table name), this function internally calls `read_sql_query()` instead of `read_sql_table().`

In [13]:
# create sql
sql = 'select * from Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(sql, con)

In [14]:
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [15]:
# Table Name 

table = 'Population'
with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(table, con)

In [16]:
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864